-----------------------------------------------------------
--- 游戏服登录逻辑
-----------------------------------------------------------
local skynet  	= require "skynet"


local HANDLER		= {}
local REQUEST 		= {}

-----------------------------------------------------------
--- 内部变量/内部逻辑
-----------------------------------------------------------

-----------------------------------------------------------
--- 网络请求接口
-----------------------------------------------------------
-- 断线重连
function REQUEST:connect()
	print("dcs------connect")
end

-- 请求断开连接
function REQUEST:disconnect()
	skynet.send(skynet.self(), "lua", "disconnect")
end

HANDLER.REQUEST   	= REQUEST
return HANDLER
